{
    "name": "Nick Major",
    "phone": "(519)535-0630",
    "email": "nickmajor78@gmail.com",
    "github": "nicboy17",
    "github_link": "https://github.com/nicboy17",
    "linkedin": "https://linkedin.com/in/nmajor17",
    "education": {
        "school": "Bachelor of Computer Engineering, University of Guelph (2018).",
        "courses": ["Engineering and Design", "System Analysis and Design", "Software Development and Integration", "Large Scale Architecture", "Wireless Sensor Networks"]
    },
    "hobbies": [
        "Hockey",
        "Fishing",
        "Wood Working"
    ],
    "skills": {
        "proficient": ["C", "Node", "Express", "Angular", "React", "Mongo"],
        "knowledge": ["Python", "Java", "SQL", "Redux", "RxJs", "NgRx", "Websockets", "Linux", "Docker", "MQTT", "Kafka"]
    },
    "projects": [
        {
            "title": "Dream Homes (Pinterest Clone)",
            "course": "",
            "year": "2019",
            "subtitle": "Hatchways",
            "description": [
                "Worked in a team of 3 to build a web application for users to browse and daydream about homes (interiors, exteriors,front yards, and back yards).",
                "Setup up CI with circle ci, CD with Heroku, and AWS S3 for file storage",
                "Technologies included: Node, Express, MongoDB, JWT, Mongoose, React, Redux, Redux-Saga, Material UI."
            ]
        },
        {
            "title": "IoT Real Time System Project",
            "course": "Design 4",
            "year": "2018",
            "subtitle": "University of Guelph",
            "description": [
                "Demonstrated strong project management skills and team collaboration while using Agile to develop a 3-layer architecture (sensory network, backend, and web application) for inventory management in assembly manufacturing.",
                "Objectives included: replenishment notification (avoid stockouts) and inventory level optimization (predict forecast future usage)",
                "Used observable pattern (Rx.js) with Angular.js to create frontend, which kept the architecture event based.",
                "Technologies included: Node, Express, MongoDB, JWT, Mongoose, HTTPS, Radio, MQTT, Angular, Websockets."
            ]
        },
        {
            "title": "IoT Hydroponics System Project",
            "course": "Wireless Sensor Networks",
            "year": "2017",
            "subtitle": "University of Guelph",
            "description": [
                "Found a solution to remotely monitor and manage miniature hydroponics farm, while under a three-week time constraint.",
                "Used Raspberry Pi as web server to control Arduino with temperature, humidity, and relay sensors.",
                "Used various communication protocols, including MQTT, Websockets, and HTTP (REST API)."
            ]
        },
        {
            "title": "Caremunity Android App Backend Project",
            "course": "System Analysis and Design in Applications",
            "year": "2017",
            "subtitle": "University of Guelph",
            "description": [
                "Worked on a team of four to design and create a backend service for Android app to help people with FASD take medications.",
                "The project followed a waterfall design process, completing each step-in turn and planning and documenting all progress.",
                "Created backend service using Node.js, Postman, and MySQL to fulfill requirements.",
                "Worked with clients through product development with paper prototyping and wire-framing."
            ]
        },
        {
            "title": "iCal Database Project",
            "course": "Software Development and Integration",
            "year": "2016",
            "subtitle": "University of Guelph",
            "description": [
                "Demonstrated sound time management skills while working on a four-stage project (parser utility library, command line extension, Python GUI, MySQL database).",
                "Overcame barriers from tight timelines, debugging, fixing bugs in lengthy programs, and learning Python and MySQL",
                "Worked with various features, including I/O, C to Python extensions, and server functionality.",
                "Developed specification reading skills by breaking down and implementing project requirements."
            ]
        }
    ],
    "work": [
        {
            "title": "Software Engineer Intern",
            "year": "Oct. 2019 – Feb. 2020",
            "subtitle": "Dot Health, Toronto",
            "description": [
                "Full-stack developer working on the admin dashboards that manages all of company operations to help retrieve medical records for users.",
                "Dashboard is built using React, NodeJS, Express, Sequelize, and MySQL."
            ]
        },
        {
            "title": "Website Designer (Self Employed)",
            "year": "2017",
            "subtitle": "Woodstock Summer Company, Woodstock",
            "description": [
                "Developed an ecommerce website using WordPress for a hydraulics company, while meeting with owners to discuss work scope, progress, and requirements."
            ]
        },
        {
            "title": "COOP Position",
            "year": "2016",
            "subtitle": "Pencom Canada, Cambridge",
            "description": [
                "Worked with quality assurance (QA) department programming a Keyence machine (image dimension measurement system).",
                "Improved inspection process by designing a Java based program to aggregate parts specifications (drawings and Excel) and Keyence programs. Additionally, implemented a partial search by using part information from the main system for easier location.",
                "Designed fixtures for scanning in parts and a jig for in-house assembly product using SolidWorks. Measured parts and made sketches.",
                "Created instructions, wrote manual, and trained warehouse staff on Keyence machine and Java program."
            ]
        }
    ]
}
